In [2]:
import pandas as pd
import numpy as np

Задание 1

In [62]:
r = np.random.RandomState(1)
s = pd.Series(r.uniform(0, 10, 100))
print(s[s > 5].index[0])

1

Задание 2

In [131]:
df = pd.DataFrame({
    'имя': ['Петя', 'Вася', 'Аня', 'Света'],
    'возраст': [45, 26, 41 , 21],
    'доход': [100000, 80000, 150000, 60000],
    'надежность клиента (0..1)': [0.65, 0.74, 0.87, 0.68],
    'пол': ['муж', 'муж', 'жен', 'жен']},
    index=[0, 1, 2, 3])

In [132]:
df['важность клиента'] = ['0', '0', '0', '0']
df.iloc[0, 5] = df.iloc[0, 2]*df.iloc[0, 3]
df.iloc[1, 5] = df.iloc[1, 2]*df.iloc[1, 3]
df.iloc[2, 5] = df.iloc[2, 2]*df.iloc[2, 3]
df.iloc[3, 5] = df.iloc[3, 2]*df.iloc[3, 3]

In [133]:
df['возможная долгосрочность клиента'] = ['0', '0', '0', '0']
df.iloc[0, 6] = df.iloc[0, 5]*(sum(df['возраст'])/(df.index[-1]+1)-df.iloc[0, 1])
df.iloc[1, 6] = df.iloc[1, 5]*(sum(df['возраст'])/(df.index[-1]+1)-df.iloc[1, 1])
df.iloc[2, 6] = df.iloc[2, 5]*(sum(df['возраст'])/(df.index[-1]+1)-df.iloc[2, 1])
df.iloc[3, 6] = df.iloc[3, 5]*(sum(df['возраст'])/(df.index[-1]+1)-df.iloc[3, 1])
df

     имя  возраст  ...  важность клиента  возможная долгосрочность клиента
0   Петя       45  ...             65000                           -763750
1   Вася       26  ...             59200                            429200
2    Аня       41  ...            130500                      -1.01138e+06
3  Света       21  ...             40800                            499800

[4 rows x 7 columns]

In [134]:
df[df['возраст'] > 40]

    имя  возраст   доход  ...  пол важность клиента возможная долгосрочность клиента
0  Петя       45  100000  ...  муж            65000                          -763750
2   Аня       41  150000  ...  жен           130500                     -1.01138e+06

[2 rows x 7 columns]

In [135]:
df[df['доход'] > sum(df['доход'])/(df.index[-1]+1)]

    имя  возраст   доход  ...  пол важность клиента возможная долгосрочность клиента
0  Петя       45  100000  ...  муж            65000                          -763750
2   Аня       41  150000  ...  жен           130500                     -1.01138e+06

[2 rows x 7 columns]

In [136]:
df = df[df['доход'] > sum(df['доход'])/(df.index[-1]+1)]
df = df[df['надежность клиента (0..1)'] > sum(df['надежность клиента (0..1)'])/(df.index[-1]+1)]
df

    имя  возраст   доход  ...  пол важность клиента возможная долгосрочность клиента
0  Петя       45  100000  ...  муж            65000                          -763750
2   Аня       41  150000  ...  жен           130500                     -1.01138e+06

[2 rows x 7 columns]

Задание 3

In [114]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['low', 'medium', 'high'] * 3,
                    'price': np.random.randint(0, 100, 9)})

df2 = pd.DataFrame({'frukt': ['apple', 'banana', 'melon'] * 2,
                    'ves': ['low', 'high'] * 3,
                    'price': np.random.randint(0, 100, 6)})

In [115]:
df2 = df2.rename(columns={'frukt': 'fruit', 'ves':'weight', 'price':'price'})

In [116]:
df = pd.concat([df1, df2], ignore_index=True)
df

     fruit  weight  price
0    apple     low     25
1   banana  medium     37
2   orange    high     34
3    apple     low      2
4   banana  medium     71
5   orange    high     83
6    apple     low     77
7   banana  medium      0
8   orange    high      6
9    apple     low     41
10  banana    high     59
11   melon     low      5
12   apple    high     90
13  banana     low     59
14   melon    high     90

Задание 4

In [106]:
df = pd.DataFrame({
    'country': ['Kazakhstan', 'Russia', 'Belarus', 'Ukraine'],
    'population': [17.04, 143.5, 9.5, 45.5],
    'square': [2724902, 17125191, 207600, 603628]})

In [107]:
df['Code'] = ['KZ', 'RU', 'BY', 'UA']

In [108]:
df['plotnost'] = ['0', '0', '0', '0']
df.iloc[0, 4] = df.iloc[0, 1]*1000000/df.iloc[0, 2]
df.iloc[1, 4] = df.iloc[1, 1]*1000000/df.iloc[1, 2]
df.iloc[2, 4] = df.iloc[2, 1]*1000000/df.iloc[2, 2]
df.iloc[3, 4] = df.iloc[3, 1]*1000000/df.iloc[3, 2]

In [109]:
df1 = pd.DataFrame({
    'country': ['USA', 'United Kingdom'],
    'population': [329.5, 55.98],
    'square': [9834, 130279],
    'Code': ['USA', 'UK'],
    'plotnost': [0, 0]})
df1.iloc[0, 4] = df1.iloc[0, 1]*1000000/df1.iloc[0, 2]
df1.iloc[1, 4] = df1.iloc[1, 1]*1000000/df1.iloc[1, 2]

In [110]:
df2 = pd.concat([df, df1], ignore_index=True)
df2

          country  population    square Code plotnost
0      Kazakhstan       17.04   2724902   KZ  6.25344
1          Russia      143.50  17125191   RU  8.37947
2         Belarus        9.50    207600   BY  45.7611
3         Ukraine       45.50    603628   UA  75.3776
4             USA      329.50      9834  USA  33506.2
5  United Kingdom       55.98    130279   UK  429.693

In [112]:
sum(df2['square'])/(df2.index[-1]+1)

3466905.6666666665